app/views/projects/show.html.erb

SELECT `photos`.* FROM `photos` WHERE `photos`.`project_id` = 1
---
<ul>
  <% @project.photos.each do |photo| %>