app/views/photos/show.html.erb

      <h2>編集ログ</h2>
      <% if @photo.action_logs.any? %>
        <ul>
            <% @photo.action_logs.each do |log| %>
---
SELECT 1 AS one FROM `action_logs` WHERE `action_logs`.`photo_id` = 30 LIMIT 1
SELECT `action_logs`.* FROM `action_logs` WHERE `action_logs`.`photo_id` = 30