app/controllers/photos_controller.rb

INSERT INTO `photos` (`note`, `taken_at`, `category`, `project_id`, `user_id`, `created_at`, `updated_at`, `image_with_blackboard`, `work_number`, `work_content`, `location`, `date`, `project_name`, `contractor`, `deleted`) VALUES ('', NULL, NULL, 1, 3, '2025-06-04 06:57:36.243156', '2025-06-04 06:57:36.243156', NULL, '123⁻4567', 'test', 'test', '2025-06-04', '福島県国道13号補修工事', '', NULL)
SELECT `photos`.* FROM `photos` WHERE `photos`.`project_id` = 1 AND `photos`.`id` = 1 LIMIT 1
INSERT INTO `blackboards` (`photo_id`, `work_number`, `work_content`, `location`, `created_at`, `updated_at`) VALUES (3, '123－45667', 'アスファルト補修', '', '2025-06-03 03:34:15.669725', '2025-06-03 03:34:15.669725')
---
  def create
  @photo = @project.photos.build(photo_params)
  @photo.user = current_user

  if @photo.save
    tmp_photo_path = Rails.root.join("tmp", "photo_#{@photo.id}.jpg")
    tmp_output_path = Rails.root.join("tmp", "combined_#{@photo.id}.jpg")

    File.open(tmp_photo_path, 'wb') { |f| f.write(@photo.image.download) }

    text_data = {
      date: @photo.date&.strftime("%Y年%m月%d日") || "日付未入力",
      work_number: @photo.work_number || "",
      work_content: @photo.work_content || "",
      location: @photo.location || "",
      project_name: @photo.project_name || "",
      contractor: @photo.contractor || ""
    }

    Magic::BlackboardOverlay.compose_overlay(
      photo_path: tmp_photo_path.to_s,
      output_path: tmp_output_path.to_s,
      text_data: text_data
    )

    File.open(tmp_output_path) do |file|
      @photo.image_with_blackboard.attach(
        io: file,
        filename: "combined_#{@photo.id}.jpg",
        content_type: 'image/jpeg'
      )

UPDATE `photos` SET `photos`.`updated_at` = '2025-06-04 03:25:37.841162', `photos`.`work_number` = '567⁻1234', `photos`.`date` = '2025-06-18', `photos`.`project_name` = '福島県国道111号補修工事' WHERE `photos`.`id` = 30
INSERT INTO `action_logs` (`user_id`, `photo_id`, `action_type`, `detail`, `created_at`, `updated_at`) VALUES (3, 19, 'destroy', NULL, '2025-06-04 05:28:09.779689', '2025-06-04 05:28:09.779689')
---
  def update
    if @photo.update(photo_params)
      ActionLog.create!(user: current_user, photo: @photo, action_type: "edit")

INSERT INTO `action_logs` (`user_id`, `photo_id`, `action_type`, `detail`, `created_at`, `updated_at`) VALUES (3, 40, 'destroy', 'Photo ID 40 を削除しました', '2025-06-04 11:56:52.484559', '2025-06-04 11:56:52.484559')
DELETE FROM `photos` WHERE `photos`.`id` = 40
---
def destroy
  deleted_photo_id = @photo.id

  # 削除前にログを記録
  ActionLog.create!(
    user: current_user,
    photo: @photo, # 関連付ける
    action_type: "destroy",
    detail: "Photo ID #{deleted_photo_id} を削除しました"
  )

  @photo.destroy

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 22 LIMIT 1
---
  def set_project
    @project = Project.find(params[:project_id])

SELECT `photos`.* FROM `photos` WHERE `photos`.`project_id` = 22 AND `photos`.`id` = 37 LIMIT 1
---
  def set_photo
    @photo = @project.photos.find(params[:id])