app/controllers/photos_controller.rb

  def set_project
    @project = Project.find(params[:project_id])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1