app/controllers/photos_controller.rb

  def show
    @photo = @project.photos.find(params[:id])
---
SELECT `photos`.* FROM `photos` WHERE `photos`.`project_id` = 3 AND `photos`.`id` = 9 LIMIT 1

  def set_project
    @project = Project.find(params[:project_id])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 3 LIMIT 1