app/controllers/projects_controller.rb

INSERT INTO `projects` (`title`, `site_name`, `start_date`, `end_date`, `user_id`, `created_at`, `updated_at`) VALUES ('福島県国道13号補修工事', '国道13号', '2025-06-03', '2025-07-12', 3, '2025-06-03 03:16:32.329032', '2025-06-03 03:16:32.329032')
---
  def create
    @project = current_user.projects.build(project_params)
    if @project.save

SELECT `projects`.* FROM `projects` WHERE `projects`.`user_id` = 3 AND `projects`.`id` = 1 LIMIT 1
SELECT `photos`.* FROM `photos` WHERE `photos`.`project_id` = 13 AND (`photos`.`deleted` = FALSE OR `photos`.`deleted` IS NULL) ORDER BY `photos`.`created_at` DESC
---
    def show
    @project = current_user.projects.find(params[:id])

    @grouped_photos = @project.photos
      .where(deleted: false)
      .order(created_at: :desc)
      .group_by { |photo| photo.created_at.to_date }